<template>
	<div class="container">
		<br>
		<br>
		<h2>Полезные ссылки</h2>
		<br>
		<router-link
			:to="{ name: 'rules'}" >
			Правила сайта
		</router-link>
		<br>
		<br>
		<router-link
			:to="{ name: 'policy'}" >
			Политика конфиденциальности
		</router-link>
		<br>
		<br>
		<hr>
		<br>

		<h2>Часто задаваемые вопросы</h2>

		<div class="faq_block"
			v-for="( block, key ) in data"
			:key="key">
			<h3>{{key}}</h3>

			<ul>
				<li class="faq_item"
					v-for="( item, i ) in block"
					:key="i">
					<span class="link" @click="item.isOpen = !item.isOpen">{{ item.h }}</span>

					<p class="faq_item_hidden" v-show="item.isOpen">{{ item.t }}</p>
				</li>
			</ul>
		</div>

		<hr>
		<br>
		<p>Остались вопросы?</p>
		<br>

		<router-link class="btn"
			:to="{ name: 'support'}" >
			Напишите в поддержку
		</router-link>
		<br>
		<br>
	</div>
</template>

<script>

export default {
	data() {
		return {
			data: {
				'Аккаунт': [
					{
						h: 'Как изменить данные на своей странице?',
						t: 'В настройках страницы возможно изменить все данные, за исключением имени и даты рождения. Если вы изменили фамилию или имя и получили новый паспорт, вам следует обратиться в поддержку пользователей на сайте.',
						isOpen: false
					},
					{
						h: 'Что делать если аккаунт заблокировали за нарушение правил?',
						t: 'Обратитесь в поддержку пользователей на сайте.',
						isOpen: false
					},
					{
						h: 'Что делать если мою страницу взломали?',
						t: 'Обратитесь в поддержку пользователей на сайте.',
						isOpen: false
					},
					{
						h: 'Как закрыть аккаунт от всех сообщений?',
						t: 'Данная функция присутствует в настройках профиля.',
						isOpen: false
					},
					{
						h: 'Как пожаловаться на другого пользователя?',
						t: 'Перейдите в профиль пользователя, на которого вы хотите оставить жалобу. Нажмите на иконку настроек и выберите соответсвующую функцию.',
						isOpen: false
					},
					{
						h: 'Как удалить аккаунт?',
						t: 'Обратитесь в поддержку пользователей на сайте.',
						isOpen: false
					},
				],
				'Группы': [
					{
						h: 'Как пройти верификацию группы?',
						t: 'Обратитесь в поддержку пользователей на сайте.',
						isOpen: false
					},
					{
						h: 'Как пожаловаться на группу?',
						t: 'Перейдите в группу, на которую вы хотите оставить жалобу. Нажмите на иконку настроек и выберите соответсвующую функцию.',
						isOpen: false
					},
					{
						h: 'Как передать права на группу?',
						t: 'Обратитесь в поддержку пользователей на сайте.',
						isOpen: false
					},
					{
						h: 'Как удалить группу?',
						t: 'Обратитесь в поддержку пользователей на сайте.',
						isOpen: false
					},
				],
			}

		}
	}
};
</script>
